Revit 2027 API
ParameterTypeId.PropertySegmentSubcategoryId Property
 "Subcategory"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PropertySegmentSubcategoryId { get; }
Public Shared ReadOnly Property PropertySegmentSubcategoryId As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PropertySegmentSubcategoryId {
	ForgeTypeId^ get ();
}
static member PropertySegmentSubcategoryId : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace